NorthernMan54/ESP32_Display_Panel/src/lv_port.c
    assert(disp_cfg != NULL);
    assert(disp_cfg->io_handle != NULL);
    assert(disp_cfg->panel_handle != NULL);
    assert(disp_cfg->buffer_size > 0);
    assert(disp_cfg->hres > 0);
    assert(disp_cfg->vres > 0);

    // LV_LOG_INFO("Add display to LVGL trans_size %d, sw_rotate %d, buffer_size %d, hres %d, vres %d", disp_cfg->trans_size, disp_cfg->sw_rotate, disp_cfg->buffer_size, disp_cfg->hres, disp_cfg->vres);
    /* Display context */
    lvgl_port_display_ctx_t *disp_ctx = malloc(sizeof(lvgl_port_display_ctx_t));
    ESP_GOTO_ON_FALSE(disp_ctx, ESP_ERR_NO_MEM, err, TAG, "Not enough memory for display context allocation!");
    disp_ctx->io_handle = disp_cfg->io_handle;
    disp_ctx->panel_handle = disp_cfg->panel_handle;
    disp_ctx->trans_size = disp_cfg->trans_size;
    disp_ctx->sw_rotate = disp_cfg->sw_rotate;
    disp_ctx->draw_wait_cb = disp_cfg->draw_wait_cb;

    uint32_t buff_caps = MALLOC_CAP_DEFAULT;
    if (disp_cfg->flags.buff_dma)
    {
        buff_caps = MALLOC_CAP_DMA;
    }
    else if (disp_cfg->flags.buff_spiram)
    {
        buff_caps = MALLOC_CAP_SPIRAM;
    }

    /* alloc draw buffers used by LVGL */
    /* it's recommended to choose the size of the draw buffer(s) to be at least 1/10 screen sized */
    buf1 = heap_caps_malloc(disp_cfg->buffer_size * sizeof(lv_color16_t), buff_caps);
    ESP_GOTO_ON_FALSE(buf1, ESP_ERR_NO_MEM, err, TAG, "Not enough memory for LVGL buffer (buf1) allocation!");

    if (disp_ctx->trans_size)
    {
        uint32_t caps = MALLOC_CAP_DMA;

        buf2 = heap_caps_malloc(disp_ctx->trans_size * sizeof(lv_color16_t), caps);
        ESP_GOTO_ON_FALSE(buf2, ESP_ERR_NO_MEM, err, TAG, "Not enough memory for buffer(transport) allocation!");
        disp_ctx->trans_buf_1 = buf2;

        buf3 = heap_caps_malloc(disp_ctx->trans_size * sizeof(lv_color16_t), caps);
        ESP_GOTO_ON_FALSE(buf3, ESP_ERR_NO_MEM, err, TAG, "Not enough memory for buffer(transport) allocation!");
        disp_ctx->trans_buf_2 = buf3;

        trans_done_sem = xSemaphoreCreateCounting(1, 0);
        ESP_GOTO_ON_FALSE(trans_done_sem, ESP_ERR_NO_MEM, err, TAG, "Failed to create transport counting Semaphore");
        disp_ctx->trans_done_sem = trans_done_sem;
    }

    //  lv_disp_draw_buf_t *disp_buf = malloc(sizeof(lv_disp_draw_buf_t));
    //  ESP_GOTO_ON_FALSE(disp_buf, ESP_ERR_NO_MEM, err, TAG, "Not enough memory for LVGL display buffer allocation!");

    /* initialize LVGL draw buffers */
    //  lv_disp_draw_buf_init(disp_buf, buf1, NULL, disp_cfg->buffer_size);

    disp = lv_display_create(disp_cfg->hres, disp_cfg->vres);
    // (lv_display_t *disp, const lv_area_t *area, uint8_t *px_map)
    lv_display_set_flush_cb(disp, lvgl_port_flush_callback);
    lv_display_set_buffers(disp, buf1, NULL, disp_cfg->buffer_size * sizeof(lv_color16_t), LV_DISPLAY_RENDER_MODE_DIRECT);

    disp_ctx->disp_drv = disp;

    LV_LOG_INFO("hres, vres %d %d", disp_cfg->hres, disp_cfg->vres);
    ESP_LOGD(TAG, "Register display driver to LVGL");
    //  lv_disp_drv_init(&disp_ctx->disp_drv);
    // disp_ctx->disp_drv.hor_res = disp_cfg->hres;
    // disp_ctx->disp_drv.ver_res = disp_cfg->vres;
    // disp_ctx->disp_drv.flush_cb = lvgl_port_flush_callback;

    // disp_ctx->disp_drv.draw_buf = disp_buf;
    // disp_ctx->disp_drv.user_data = disp_ctx;
    /* Force full_fresh */
    // disp_ctx->disp_drv.full_refresh = 1;

#if LVGL_PORT_HANDLE_FLUSH_READY
    /* Register done callback */
    const esp_lcd_panel_io_callbacks_t cbs = {
        .on_color_trans_done = lvgl_port_flush_ready_callback,
    };
    esp_lcd_panel_io_register_event_callbacks(disp_cfg->io_handle, &cbs, &disp);
#endif

    //    disp = lv_disp_drv_register(&disp_ctx->disp_drv);

err:
    if (ret != ESP_OK)
    {
        if (buf1)
        {
            free(buf1);
        }
        if (buf2)
        {
            free(buf2);
        }
        if (buf3)
        {
            free(buf3);
        }
        if (trans_done_sem)
        {
            vSemaphoreDelete(trans_done_sem);
        }
        if (disp_ctx)
        {
            free(disp_ctx);
        }
    }

    lv_display_set_user_data(disp, disp_ctx);
    return disp;
}

esp_err_t lvgl_port_remove_disp(lv_disp_t *disp)
{
    assert(disp);
    //   lv_disp_drv_t *disp_drv = disp->driver;
    //   assert(disp_drv);
    lvgl_port_display_ctx_t *disp_ctx = (lvgl_port_display_ctx_t *)lv_display_get_user_data(disp);

    lv_disp_remove(disp);

    /*
        if (disp_drv)
        {
            if (disp_drv->draw_buf && disp_drv->draw_buf->buf1)
            {
                free(disp_drv->draw_buf->buf1);
                disp_drv->draw_buf->buf1 = NULL;
            }
            if (disp_drv->draw_buf && disp_drv->draw_buf->buf2)
            {
                free(disp_drv->draw_buf->buf2);
                disp_drv->draw_buf->buf2 = NULL;
            }
            if (disp_drv->draw_buf)
            {
                free(disp_drv->draw_buf);
                disp_drv->draw_buf = NULL;
            }
        }
    */
    free(disp_ctx);

    return ESP_OK;
}

#ifdef ESP_LVGL_PORT_TOUCH_COMPONENT
lv_indev_t *lvgl_port_add_touch(const lvgl_port_touch_cfg_t *touch_cfg)
{
    assert(touch_cfg != NULL);
    assert(touch_cfg->disp != NULL);
    assert(touch_cfg->handle != NULL);

    /* Touch context */
    lvgl_port_touch_ctx_t *touch_ctx = malloc(sizeof(lvgl_port_touch_ctx_t));
    if (touch_ctx == NULL)
    {
        ESP_LOGE(TAG, "Not enough memory for touch context allocation!");
        return NULL;
    }
    touch_ctx->handle = touch_cfg->handle;
    touch_ctx->touch_wait_cb = touch_cfg->touch_wait_cb;

    lv_indev_t *indev = lv_indev_create();
    lv_indev_set_type(indev, LV_INDEV_TYPE_POINTER);
    lv_indev_set_read_cb(indev, lvgl_port_touchpad_read);

    /* Register a touchpad input device */
    //  lv_indev_drv_init(&touch_ctx->indev_drv);
    //  touch_ctx->indev_drv.type = LV_INDEV_TYPE_POINTER;
    //  touch_ctx->indev_drv.disp = touch_cfg->disp;
    //  touch_ctx->indev_drv.read_cb = lvgl_port_touchpad_read;
    //  touch_ctx->indev_drv.user_data = touch_ctx;
    lv_indev_set_user_data(indev, touch_ctx);
    return indev;
}

